tap "homebrew/cask"
tap "homebrew/cask-fonts"

#### Utilitaries ####
cask "raycast"              # App launcher  
cask "bartender"            # Keep the menu bar clean and tidy
cask "cleanmymac"           # Clean and monitor the mac
cask "cleanshot"            # Capture the mac screen
cask "1password"            # Password manager
# cask "karabiner-elements" # Keyboard customizer
# cask "bettertouchtool"    # Customize input device

#### Productivity #### 
cask "todoist"              # Task management
cask "cron"                 # Calendar on steroid
cask "obsidian"             # Knowledge base that use markdown
# cask "notion"             # App to write, plan, collaborate, and get organized

#### Software development ####
cask "iterm2"               # Enhance terminal
cask "visual-studio-code"   # Simple IDE
cask "nvim"                 # Ambitious Vim-fork focused on extensibility and agility
cask "git"                  # Distributed revision control system
cask "node"                 # Platform built on V8 to build network applications

#### Communication ####
cask "discord"              # Place to talk and hang out
# cask "slack"              # Async communication app

#### Design ####
cask "figma"                # The design app
cask "affinity-designer"    # Vector design app
# cask "affinity-photo"     # Photo editor app
# cask "affinity-publisher" # Publishing app 
# cask "blender"            # 3d modelisation app

#### Other ####
cask "google-chrome"        # Browser from google
cask "spotify"              # Music streaming app

#### Fonts ####
cask "font-inter"           
cask "font-jetbrains-mono"              # Typeface made for developers by jetbrains 
cask "font-jetbrains-mono-nerd-font"    # Developer targeted fonts with a high number of glyphs
cask "font-mona-sans"                   # Mona Sans, a variable font from GitHub
cask "font-hubot-sans"                  # Hubot Sans, a variable font from GitHub
cask "font-fira-code"                   # Free monospaced font with programming ligatures by Mozilla
cask "font-fira-mono"                   # Free monospaced font with programming ligatures by Mozilla
cask "font-fira-sans"                   # Free monospaced font with programming ligatures by Mozilla
